using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace NadyNeUbivai
{
    internal class Drawyer
    {
        public static void Draw(int count) 
        {
            switch (count)
            {
                case 10:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                    $"\n" +
                    $"\n" +
                    $"\n" +
                    $"\n" +
                    $"\n" +
                    $"\n" +
                    $"\n" +
                    $"\n" +
                    $@"_________________" + "\n");
                    break;
                case 9:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  ___\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $@"  | |_____________" + "\n");
                    break;
                case 8:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | | \n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |_____________\n");
                    break;
                case 7:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $@"  | |\" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
                case 6:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |      |     \n" +
                $"  | |\n" +
                $"  | |\n" +
                $"  | |\n" +
                $@"  | |\" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
                case 5:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |      |     \n" +
                $"  | |     (_)    \n" +
                $@"  | |" + "\n" +
                $"  | |\n" +
                $@"  | |\" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
                case 4:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |      |     \n" +
                $"  | |     (_)    \n" +
                $@"  | |      |" + "\n" +
                $"  | |      |\n" +
                $@"  | |\" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
                case 3:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |      |     \n" +
                $"  | |     (_)    \n" +
                $@"  | |     /|" + "\n" +
                $"  | |      |\n" +
                $@"  | |\" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
                case 2:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |      |     \n" +
                $"  | |     (_)    \n" +
                $@"  | |     /|\" + "\n" +
                $"  | |      |\n" +
                $@"  | |\" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
                case 1:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |      |     \n" +
                $"  | |     (_)    \n" +
                $@"  | |     /|\" + "\n" +
                $"  | |      |\n" +
                $@"  | |\    /" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
                case 0:
                    Console.WriteLine($"У вас осталось {count} попыток\n" +
                $"  _______________\n" +
                $"  |_____________|\n" +
                $"  | |      |     \n" +
                $"  | |     (_)    \n" +
                $@"  | |     /|\" + "\n" +
                $"  | |      | \n" +
                $@"  | |\    / \" + "\n" +
                $@"  | |\\" + "\n" +
                $@"  | |_\\__________" + "\n");
                    break;
            }
        }
        
}
}
